""" Задача 24:
В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке,
причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло
различное число ягод – на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве внедрена система автоматического сбора
черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход,
находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
находясь перед некоторым кустом заданной во входном файле грядки """
import random

N = random.randint(3, 4)
bush_harvest = []
for i in range(N):
    bush_harvest.append(random.randint(1, 10))

print(bush_harvest)


def find_max():
    max = 0
    for i in range(0, N):
        a, b, c = bush_harvest[i - 2], bush_harvest[i - 1], bush_harvest[i]
        current = a + b + c
        if current > max:
            max = current

    return f"Модуль может за раз собрать максимально {max} ягод.)"


print(find_max())
